# Ввести двухзначное число. Если сумма цифр числа чётная,
# то увеличить число на 2, в противном случае уменьшить на 2.

n = input('Введите двузначное число: ')

while type(n) != float:
    try:
        n = float(n)
    except ValueError:
        print('Нужно ввести число')
        n = input('Введите число: ')

des = n // 10
ed = n % 10

if (des + ed) % 2 == 0:
    chet = n + 2
    print(f'Сумма цифр числа четная. Результат действия: {chet}')
else:
    nechet = n - 2
    print(f'Сумма цифр числа четная. Результат действия: {nechet}')