# Ввести 2 числа. Если их произведение отрицательно,
# умножить его на 8, в противном случае увеличить его в 1.5 раза.

n1 = input('Введите число: ')
n2 = input('Введите число: ')

while type(n1) != float:
    try:
        n1 = float(n1)
    except ValueError:
        print('Нужно ввести число')
        n1 = input('Введите число: ')
while type(n2) != float:
    try:
        n2 = float(n2)
    except ValueError:
        print('Нужно ввести число')
        n2 = input('Введите число: ')

if (n1 * n2) < 0:
    otr = (n1 * n2) * 8
    print(f'Произведение отрицательно. Результат действия: {otr}')
else:
    pol = (n1 * n2) * 1.5
    print(f'Произведение положительно. Результат действия: {pol}')